In [1]:
#imports
import pandas as pd
import numpy as np

In [2]:
ebola_df=pd.read_csv('https://bit.ly/2T60DKG')
ebola_first=ebola_df.head(10) #first ten records

ebola_last=ebola_df.tail(10) #last ten records

ebola_sample=ebola_df.sample(20) #samplng 20 data sets

print(ebola_first)

  Country  Month  Year   Lat  Lon   Value
0  Guinea      3    14  9.95 -9.7   122.0
1  Guinea      4    14  9.95 -9.7   224.0
2  Guinea      5    14  9.95 -9.7   291.0
3  Guinea      6    14  9.95 -9.7   413.0
4  Guinea      7    14  9.95 -9.7   460.0
5  Guinea      8    14  9.95 -9.7   771.0
6  Guinea      9    14  9.95 -9.7  1022.0
7  Guinea     10    14  9.95 -9.7     NaN
8  Guinea     11    14  9.95 -9.7     NaN
9  Guinea     12    14  9.95 -9.7     NaN

In [3]:
#SELECTING COLUMNS

#METHOD 1

ebola_value_col=ebola_df[['Value']]  #one column
# ebola_value_col.head()

ebola_multiple_col=ebola_df[['Country','Month','Value']] #multiple columns
ebola_multiple_col.head()

  Country  Month  Value
0  Guinea      3  122.0
1  Guinea      4  224.0
2  Guinea      5  291.0
3  Guinea      6  413.0
4  Guinea      7  460.0

In [4]:
#METHOD 2
ebola_columns=ebola_df.iloc[:,0:4]  #first four columns
ebola_columns.head()

  Country  Month  Year   Lat
0  Guinea      3    14  9.95
1  Guinea      4    14  9.95
2  Guinea      5    14  9.95
3  Guinea      6    14  9.95
4  Guinea      7    14  9.95

In [ ]:
#METHOD 3 :SELECTING COLUMNS WITH UNIQUE VALUES

ebola_countries=ebola_df['Country'].unique()
list(ebola_countries)

In [5]:

#selecting columns with certain specific values
liberia_records = ebola_df[ebola_df.Country.isin(['Liberia'])]

liberia_records

    Country  Month  Year   Lat   Lon   Value
10  Liberia      4    14  6.43 -9.43    35.0
11  Liberia      5    14  6.43 -9.43    13.0
12  Liberia      6    14  6.43 -9.43   107.0
13  Liberia      7    14  6.43 -9.43   329.0
14  Liberia      8    14  6.43 -9.43  1395.0
15  Liberia      9    14  6.43 -9.43  3362.0
16  Liberia     10    14  6.43 -9.43     NaN
17  Liberia     11    14  6.43 -9.43     NaN
18  Liberia     12    14  6.43 -9.43     NaN

In [6]:
#selecting oother records other than Liberia using the NOT operator
other_Records = ebola_df[~ebola_df.Country.isin(['Liberia'])]

other_Records

         Country  Month  Year    Lat    Lon   Value
0         Guinea      3    14   9.95  -9.70   122.0
1         Guinea      4    14   9.95  -9.70   224.0
2         Guinea      5    14   9.95  -9.70   291.0
3         Guinea      6    14   9.95  -9.70   413.0
4         Guinea      7    14   9.95  -9.70   460.0
5         Guinea      8    14   9.95  -9.70   771.0
6         Guinea      9    14   9.95  -9.70  1022.0
7         Guinea     10    14   9.95  -9.70     NaN
8         Guinea     11    14   9.95  -9.70     NaN
9         Guinea     12    14   9.95  -9.70     NaN
19          Mali     10    14  17.57  -4.00     1.0
20          Mali     11    14  17.57  -4.00     8.0
21       Senegal      8    14  14.50 -14.45     1.0
22       Senegal      9    14  14.50 -14.45     3.0
23  Sierra Leone      5    14   8.46 -11.78    50.0
24  Sierra Leone      6    14   8.46 -11.78   239.0
25  Sierra Leone      7    14   8.46 -11.78   533.0
26  Sierra Leone      8    14   8.46 -11.78  1216.0
27  Sierra Leone      9    14   8.46 -11.78  1940.0
28  Sierra Leone     10    14   8.46 -11.78     NaN
29  Sierra Leone     11    14   8.46 -11.78     NaN
30  Sierra Leone     12    14   8.46 -11.78     NaN

In [7]:
#SORTING PARTICULAR RECORDS IN ASCENDING OR DESCENDING ORDER

# From the ebola dataset sort the Guinea records in descending order
guinea_records=ebola_df[ebola_df.Country.isin(['Guinea'])].sort_values(by='Value',ascending=1)
guinea_records.head()

  Country  Month  Year   Lat  Lon  Value
0  Guinea      3    14  9.95 -9.7  122.0
1  Guinea      4    14  9.95 -9.7  224.0
2  Guinea      5    14  9.95 -9.7  291.0
3  Guinea      6    14  9.95 -9.7  413.0
4  Guinea      7    14  9.95 -9.7  460.0

In [8]:
#   RANKING A DATA SET AND CREATING A COLUMN FOR THE RANK
#ranking the ebola data frame by value column data in ascending order
ebola_df['Rank']=ebola_df['Value'].rank(ascending=1)
ebola_df.head()

  Country  Month  Year   Lat  Lon  Value  Rank
0  Guinea      3    14  9.95 -9.7  122.0   9.0
1  Guinea      4    14  9.95 -9.7  224.0  10.0
2  Guinea      5    14  9.95 -9.7  291.0  12.0
3  Guinea      6    14  9.95 -9.7  413.0  14.0
4  Guinea      7    14  9.95 -9.7  460.0  15.0

AGGREGATE FUNCTIONS

In [9]:
#using shape to determine the number of records in a selected sample i.e the dimensions of the data frame

liberia_records.shape

(9, 6)

In [10]:
# The number of values occuring across all variables
ebola_df.count()

Country    31
Month      31
Year       31
Lat        31
Lon        31
Value      22
Rank       22
dtype: int64

In [11]:
#finding out if all the values are unique
ebola_df[ebola_df.duplicated()].shape

(0, 7)

In [13]:
# How many ebola cases in Sierra Leone were reported given the ebola dataset?
sierra_cases_sum=ebola_df[ebola_df.Country.isin(['Sierra Leone'])][['Value']].sum()
sierra_cases_sum

Value    3978.0
dtype: float64

In [17]:
# the record that has the least number of cases
least_cases=ebola_df.min()
least_cases

Country    Guinea
Month           3
Year           14
Lat          6.43
Lon        -14.45
Value         1.0
Rank          1.5
dtype: object

In [16]:
# the record that has maximum number of cases
highest_cases=ebola_df.max()
highest_cases

Country    Sierra Leone
Month                12
Year                 14
Lat               17.57
Lon                -4.0
Value            3362.0
Rank               22.0
dtype: object

In [20]:
# What was the average number of ebola cases in Sierra Leone?

Sierra_mean=ebola_df[ebola_df.Country.isin(['Sierra Leone'])][['Value']].mean()
Sierra_mean

795

In [24]:
#The most frequent value in ebola dataset

ebola_mode=ebola_df['Country'].mode()
ebola_mode

0    Guinea
Name: Country, dtype: object

In [27]:
ebola_median=ebola_df['Value'].median()
ebola_median

265.0